Revit 2026 API

# ColorFillSchemeEntryGetStringValue Method

---

Gets the String value stored within the entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetStringValue()
```
```vb
Public Function GetStringValue As String
```
```cpp
public:
String^ GetStringValue()
```
```fsharp
member GetStringValue : unit -> string
```

#### Return Value

String The String contained in the entry.

This method should only be used if the StorageType property reports the type of the entry as a String.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace